Revit 2026 API

# StructuralSectionsServiceData Class

---

The data needed by section type server to perform type definition.

SystemObject Autodesk.Revit.DB.StructureStructuralSectionsServiceData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralSectionsServiceData : IDisposable
```
```vb
Public Class StructuralSectionsServiceData
	Implements IDisposable
```
```cpp
public ref class StructuralSectionsServiceData : IDisposable
```
```fsharp
type StructuralSectionsServiceData =
    class
        interface IDisposable
    end
```

The StructuralSectionsServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The current document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the StructuralSectionsServiceData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace